RayGA17/Bambu-Progress-Bar/Esp8266/v3.0.cpp
  // 更新 LED
  if (!pauseLedUpdate) {
    updateLED();
    updateTestLed();
  }

  // 监控堆内存
  if (ESP.getFreeHeap() < 8000 && currentMillis - lastHeapWarningTime > 2000) {
    Serial.println("警告：堆内存低，仅剩 " + String(ESP.getFreeHeap()) + " 字节");
    lastHeapWarningTime = currentMillis;
  }

  // 如果状态变化，更新模式判断时间戳
  if (currentState != lastState) {
    lastModeJudgmentTime = millis();
    lastState = currentState;
    Serial.println("模式变更为：" + String(currentState));
  }
}

void configModeCallback(WiFiManager *myWiFiManager) {
  currentState = AP_MODE;
  lastModeJudgmentTime = millis();
  apClientConnected = false;
  Serial.println("进入 AP 模式");
}

void saveConfigCallback() {
  saveConfig();
}

void loadConfig() {
  File configFile = LittleFS.open("/config.json", "r");
  if (!configFile) {
    Serial.println("未找到配置文件，使用默认值");
    return;
  }
  size_t size = configFile.size();
  if (size > 1024) {
    Serial.println("配置文件过大");
    configFile.close();
    return;
  }
  char buf[1024];
  configFile.readBytes(buf, size);
  configFile.close();
  StaticJsonDocument<1024> doc;
  DeserializationError error = deserializeJson(doc, buf);
  if (error) {
    Serial.println("解析配置文件失败：" + String(error.c_str()));
    return;
  }
  strncpy(uid, doc["uid"] | "", sizeof(uid) - 1);
  uid[sizeof(uid) - 1] = '\0';
  strncpy(accessToken, doc["accessToken"] | "", sizeof(accessToken) - 1);
  accessToken[sizeof(accessToken) - 1] = '\0';
  strncpy(deviceID, doc["deviceID"] | "", sizeof(deviceID) - 1);
  deviceID[sizeof(deviceID) - 1] = '\0';
  globalBrightness = doc["brightness"] | 50;
  strncpy(standbyMode, doc["standbyMode"] | "marquee", sizeof(standbyMode) - 1);
  standbyMode[sizeof(standbyMode) - 1] = '\0';
  overlayMarquee = doc["overlayMarquee"] | false;
  progressBarColor = doc["progressBarColor"] | strip.Color(0, 255, 0);
  standbyBreathingColor = doc["standbyBreathingColor"] | strip.Color(0, 0, 255);
  progressBarBrightnessRatio = doc["progressBarBrightnessRatio"] | 1.0;
  standbyBrightnessRatio = doc["standbyBrightnessRatio"] | 1.0;
  customPushallInterval = doc["customPushallInterval"] | 30;
  strip.setBrightness(constrain(globalBrightness, 0, 255));
}

void saveConfig() {
  StaticJsonDocument<1024> doc;
  doc["uid"] = uid;
  doc["accessToken"] = accessToken;
  doc["deviceID"] = deviceID;
  doc["brightness"] = globalBrightness;
  doc["standbyMode"] = standbyMode;
  doc["overlayMarquee"] = overlayMarquee;
  doc["progressBarColor"] = progressBarColor;
  doc["standbyBreathingColor"] = standbyBreathingColor;
  doc["progressBarBrightnessRatio"] = progressBarBrightnessRatio;
  doc["standbyBrightnessRatio"] = standbyBrightnessRatio;
  doc["customPushallInterval"] = customPushallInterval;
  File configFile = LittleFS.open("/config.json", "w");
  if (!configFile) {
    Serial.println("无法写入配置文件");
    return;
  }
  serializeJson(doc, configFile);
  configFile.close();
  sendPushall();
}

void reconnectMQTT() {
  unsigned long currentMillis = millis();
  if (currentMillis - lastReconnectAttempt < reconnectInterval) return;
  lastReconnectAttempt = currentMillis;

  String clientID = "ESP8266Client-" + String(random(0xffff), HEX);
  Serial.println("连接到 MQTT 服务器：" + String(mqttServer));
  if (mqttClient.connect(clientID.c_str(), uid, accessToken)) {
    String topicSub = mqttTopicSub;
    topicSub.replace("{DEVICE_ID}", deviceID);
    mqttClient.subscribe(topicSub.c_str());
    currentState = CONNECTED_PRINTER;
    lastModeJudgmentTime = millis();
    mqttError = "";
    Serial.println("MQTT 连接成功");
    sendPushall();
  } else {
    mqttError = "MQTT 连接失败，错误码=" + String(mqttClient.state());
    Serial.println(mqttError);
  }
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  StaticJsonDocument<1024> doc;
  DeserializationError error = deserializeJson(doc, payload, length);
  if (error) {
    Serial.println("JSON 解析失败：" + String(error.c_str()));
    return;
  }
  if (doc.containsKey("print")) {
    JsonObject printData = doc["print"];
    if (doc.containsKey("command") && doc["command"] == "pushall") {
      printerState.clear();
      for (JsonPair kv : printData) {
        printerState[kv.key()] = kv.value();
      }
      Serial.println("全量校准完成");
    } else {
      for (JsonPair kv : printData) {
        printerState[kv.key()] = kv.value();
      }
      Serial.println("增量累积完成");
    }

    if (printerState.containsKey("gcode_state")) {
      gcodeState = printerState["gcode_state"].as<String>();
    }
    if (printerState.containsKey("mc_percent")) {
      printPercent = printerState["mc_percent"].as<int>();
    }
    if (printerState.containsKey("mc_remaining_time")) {
      remainingTime = printerState["mc_remaining_time"].as<int>();
    }
    if (printerState.containsKey("layer_num")) {
      layerNum = printerState["layer_num"].as<int>();
    }

    if (forcedMode == NONE) {
      if (isPrinting()) {
        currentState = PRINTING;
      } else if (gcodeState == "FAILED") {
        currentState = ERROR;
      } else {
        currentState = CONNECTED_PRINTER;
      }
    } else if (forcedMode == PROGRESS) {
      currentState = PRINTING;
    } else if (forcedMode == STANDBY) {
      currentState = CONNECTED_PRINTER;
    }

    lastModeJudgmentTime = millis();
    Serial.print("打印状态：" + gcodeState + "，进度：" + String(printPercent) + "%");
  }
}

void sendPushall() {
  StaticJsonDocument<256> pushall_request;
  pushall_request["pushing"]["sequence_id"] = String(millis());
  pushall_request["pushing"]["command"] = "pushall";
  pushall_request["pushing"]["version"] = 1;
  pushall_request["pushing"]["push_target"] = 1;
  String payload;
  serializeJson(pushall_request, payload);
  String topicPub = mqttTopicPub;
  topicPub.replace("{DEVICE_ID}", deviceID);
  mqttClient.publish(topicPub.c_str(), payload.c_str());
  Serial.println("发送 pushall 请求");
}

uint32_t getRainbowColor(float position) {
  position = fmod(position, 1.0);
  if (position < 0.166) return strip.Color(255, 0, 255 * (position / 0.166));
  else if (position < 0.333) return strip.Color(255 * (1 - (position - 0.166) / 0.166), 0, 255);
  else if (position < 0.5) return strip.Color(0, 255 * ((position - 0.333) / 0.166), 255);
  else if (position < 0.666) return strip.Color(0, 255, 255 * (1 - (position - 0.5) / 0.166));
  else if (position < 0.833) return strip.Color(255 * ((position - 0.666) / 0.166), 255, 0);
  else return strip.Color(255, 255 * (1 - (position - 0.833) / 0.166), 0);
}

