RayGA17/Bambu-Progress-Bar/Esp8266/v3.0.cpp
void updateLED() {
  static unsigned long lastUpdate = 0;
  if (millis() - lastUpdate < ledUpdateInterval) return;
  lastUpdate = millis();
  lastLedProcessTime = millis();
  if (testingLed) return;
  strip.clear();

  if (currentState == AP_MODE) {
    apClientConnected = WiFi.softAPgetStationNum() > 0;
    strip.setPixelColor(0, apClientConnected ? strip.Color(0, 255, 0) : ((millis() / 500) % 2 ? strip.Color(255, 255, 0) : strip.Color(0, 255, 0)));
  } else if (currentState == CONNECTING_WIFI || currentState == CONNECTING_PRINTER) {
    strip.setPixelColor(0, (millis() / 500) % 2 ? strip.Color(255, 0, 0) : strip.Color(0, 0, 255));
  } else if (currentState == CONNECTED_WIFI) {
    strip.setPixelColor(0, strip.Color(0, 0, 255));
    strip.setPixelColor(1, (millis() / 500) % 2 ? strip.Color(255, 0, 0) : 0);
  } else if (currentState == CONNECTED_PRINTER || currentState == PRINTING) {
    if (currentState == PRINTING) {
      float pixels = printPercent * LED_COUNT / 100.0;
      int fullPixels = floor(pixels);
      float partialPixel = pixels - fullPixels;
      for (int i = 0; i < fullPixels; i++) {
        strip.setPixelColor(i, progressBarColor);
      }
      if (fullPixels < LED_COUNT && partialPixel > 0) {
        uint8_t r = (progressBarColor >> 16) & 0xFF;
        uint8_t g = (progressBarColor >> 8) & 0xFF;
        uint8_t b = progressBarColor & 0xFF;
        strip.setPixelColor(fullPixels, strip.Color(r * partialPixel, g * partialPixel, b * partialPixel));
      }
      strip.setBrightness(constrain(globalBrightness * progressBarBrightnessRatio, 0, 255));
      
      if (overlayMarquee) {
        for (int i = 0; i <= fullPixels; i++) {
          float pos = (float)(i + marqueePosition) / LED_COUNT;
          uint32_t rainbowColor = getRainbowColor(pos);
          uint8_t r = (rainbowColor >> 16) & 0xFF;
          uint8_t g = (rainbowColor >> 8) & 0xFF;
          uint8_t b = rainbowColor & 0xFF;
          uint8_t pr = (progressBarColor >> 16) & 0xFF;
          uint8_t pg = (progressBarColor >> 8) & 0xFF;
          uint8_t pb = progressBarColor & 0xFF;
          strip.setPixelColor(i, strip.Color((r + pr) / 2, (g + pg) / 2, (b + pb) / 2));
        }
        marqueePosition = (marqueePosition + 1) % LED_COUNT;
      }
    } else {
      if (strcmp(standbyMode, "marquee") == 0) {
        for (int i = 0; i < LED_COUNT; i++) {
          float pos = (float)(i + marqueePosition) / LED_COUNT;
          strip.setPixelColor(i, getRainbowColor(pos));
        }
        marqueePosition = (marqueePosition + 1) % LED_COUNT;
        strip.setBrightness(constrain(globalBrightness * standbyBrightnessRatio, 0, 255));
      } else if (strcmp(standbyMode, "breathing") == 0) {
        float brightness = (sin(millis() / 1000.0 * PI) + 1) / 2.0;
        int scaledBrightness = brightness * globalBrightness * standbyBrightnessRatio;
        for (int i = 0; i < LED_COUNT; i++) {
          strip.setPixelColor(i, standbyBreathingColor);
        }
        strip.setBrightness(constrain(scaledBrightness, 0, 255));
      }
    }
  } else if (currentState == ERROR) {
    for (int i = 0; i < LED_COUNT; i++) {
      strip.setPixelColor(i, (millis() / 500) % 2 ? strip.Color(255, 0, 0) : 0);
    }
  }
  strip.show();
}

void updateTestLed() {
  if (!testingLed) return;
  if (millis() - lastTestLedUpdate < testLedInterval) return;
  lastTestLedUpdate = millis();
  lastLedProcessTime = millis();
  strip.clear();
  if (testLedIndex < LED_COUNT) {
    strip.setPixelColor(testLedIndex, strip.Color(255, 255, 255));
    strip.show();
    testLedIndex++;
  } else {
    testingLed = false;
    testLedIndex = 0;
    strip.clear();
    strip.show();
  }
}

bool checkClientAccess() {
  IPAddress clientIP = server.client().remoteIP();
  if (activeClientIP == IPAddress(0, 0, 0, 0)) {
    activeClientIP = clientIP;
    activeClientTimeout = millis();
    Serial.println("新客户端连接：" + clientIP.toString());
    return true;
  } else if (clientIP == activeClientIP) {
    activeClientTimeout = millis();
    return true;
  } else {
    Serial.println("拒绝客户端：" + clientIP.toString());
    return false;
  }
}

void handleRoot() {
  if (!checkClientAccess()) {
    server.send(403, "text/html", "<h1>访问被拒绝</h1><p>另一个设备正在配置。</p>");
    return;
  }

  isWebServing = true;
  pauseLedUpdate = true;
  webResponseStartTime = millis();

  File file = LittleFS.open("/index.html", "r");
  if (!file) {
    server.send(500, "text/plain", "无法加载页面");
    isWebServing = false;
    pauseLedUpdate = false;
    return;
  }

  String html;
  html.reserve(file.size());
  while (file.available()) {
    html += (char)file.read();
  }
  file.close();

  String stateText;
  switch (currentState) {
    case AP_MODE: stateText = "AP 模式"; break;
    case CONNECTING_WIFI: stateText = "正在连接 WiFi"; break;
    case CONNECTED_WIFI: stateText = "WiFi 已连接"; break;
    case CONNECTING_PRINTER: stateText = "正在连接打印机"; break;
    case CONNECTED_PRINTER: stateText = "打印机已连接"; break;
    case PRINTING: stateText = "打印中（进度：" + String(printPercent) + "%）"; break;
    case ERROR: stateText = "打印错误"; break;
  }

  char progressBarColorHex[8];
  snprintf(progressBarColorHex, sizeof(progressBarColorHex), "#%06X", progressBarColor);
  char standbyBreathingColorHex[8];
  snprintf(standbyBreathingColorHex, sizeof(standbyBreathingColorHex), "#%06X", standbyBreathingColor);

  char pbrStr[5];
  snprintf(pbrStr, sizeof(pbrStr), "%.1f", progressBarBrightnessRatio);
  char sbrStr[5];
  snprintf(sbrStr, sizeof(sbrStr), "%.1f", standbyBrightnessRatio);

  html.replace("{STATE}", stateText);
  html.replace("{UID}", String(uid));
  html.replace("{ACCESSTOKEN}", String(accessToken));
  html.replace("{DEVICEID}", String(deviceID));
  html.replace("{BRIGHTNESS}", String(globalBrightness));
  html.replace("{MARQUEE_SELECTED}", strcmp(standbyMode, "marquee") == 0 ? "selected" : "");
  html.replace("{BREATHING_SELECTED}", strcmp(standbyMode, "breathing") == 0 ? "selected" : "");
  html.replace("{PROGRESSBARCOLOR}", String(progressBarColorHex));
  html.replace("{STANDBYBREATHINGCOLOR}", String(standbyBreathingColorHex));
  html.replace("{PROGRESSBARBRIGHTNESSRATIO}", String(pbrStr));
  html.replace("{STANDBYBRIGHTNESSRATIO}", String(sbrStr));
  html.replace("{CUSTOMPUSHALLINTERVAL}", String(customPushallInterval));
  html.replace("{OVERLAYMARQUEE_CHECKED}", overlayMarquee ? "checked" : "");

