RayGA17/Bambu-Progress-Bar/Esp8266/v3.0.cpp
  String logContent = "WiFi 状态：" + String(WiFi.status() == WL_CONNECTED ? "已连接" : "未连接") + "<br>"
                      "配置状态：" + String(isConfigValid() ? "有效" : "无效") + "<br>"
                      "MQTT 状态：" + String(mqttClient.connected() ? "已连接" : mqttError) + "<br>"
                      "打印机状态：" + gcodeState + "<br>"
                      "打印进度：" + String(printPercent) + "%<br>"
                      "剩余时间：" + String(remainingTime) + " 分钟<br>"
                      "层数：" + String(layerNum) + "<br>"
                      "喷嘴温度：" + String(printerState["nozzle_temper"].as<float>()) + "°C<br>"
                      "热床温度：" + String(printerState["bed_temper"].as<float>()) + "°C<br>"
                      "LED 模式：" + ledMode + "<br>"
                      "进度条颜色：#" + String(progressBarColor, HEX).substring(2) + "<br>"
                      "待机呼吸灯颜色：#" + String(standbyBreathingColor, HEX).substring(2) + "<br>"
                      "进度条亮度比例：" + String(progressBarBrightnessRatio) + "<br>"
                      "待机亮度比例：" + String(standbyBrightnessRatio) + "<br>"
                      "叠加跑马灯：" + String(overlayMarquee ? "启用" : "禁用") + "<br>"
                      "强制模式：" + String(forcedMode == NONE ? "无" : (forcedMode == PROGRESS ? "进度条" : "待机")) + "<br>"
                      "全量包间隔：" + String(customPushallInterval) + " 秒<br>"
                      "可用堆内存：" + String(ESP.getFreeHeap()) + " 字节";
  server.send(200, "text/html; charset=utf-8", logContent);
  isWebServing = false;
}

void handleClearCache() {
  isWebServing = true;
  webResponseStartTime = millis();
  String response = "<script>alert('缓存已清理！'); window.location.href='/';</script>";
  server.send(200, "text/html; charset=utf-8", response);
  isWebServing = false;
}

void handleResetConfig() {
  isWebServing = true;
  webResponseStartTime = millis();
  LittleFS.remove("/config.json");
  forcedMode = NONE;
  String response = "<script>alert('配置已重置，设备将重启！'); window.location.href='/';</script>";
  server.send(200, "text/html; charset=utf-8", response);
  isWebServing = false;
  delay(1000);
  ESP.restart();
}

void handleSwitchMode() {
  if (!checkClientAccess()) {
    server.send(403, "text/html", "<h1>访问被拒绝</h1><p>另一个设备正在配置。</p>");
    return;
  }
  isWebServing = true;
  webResponseStartTime = millis();
  if (server.hasArg("mode")) {
    String mode = server.arg("mode");
    String modeName = mode == "progress" ? "进度条" : "待机";
    if (mode == "progress") {
      forcedMode = PROGRESS;
      currentState = PRINTING;
    } else if (mode == "standby") {
      forcedMode = STANDBY;
      currentState = CONNECTED_PRINTER;
    }
    lastModeJudgmentTime = millis();
    String response = "<script>alert('模式已切换到 " + modeName + "！'); window.location.href='/';</script>";
    server.send(200, "text/html; charset=utf-8", response);
  } else {
    String response = "<script>alert('缺少模式参数！'); window.location.href='/';</script>";
    server.send(400, "text/html; charset=utf-8", response);
  }
  isWebServing = false;
}